<a href="https://colab.research.google.com/github/cokejunkie8191/data_scientist/blob/chapter_2/2_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [11]:
# ライブラリのインポート
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd
from pandas import Series, DataFrame

import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
# 結果にグラフを表示
%matplotlib inline

# 小数第3位まで表示
%precision 3

'%.3f'

Seriesの使い方

In [12]:
# Series
sample_pandas_data = pd.Series((i * 10 for i in range(0, 10)))
print(sample_pandas_data)

sample_pandas_index_data = pd.Series((i * 10 for i in range(0, 10)), index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
print(sample_pandas_index_data)

print('データの値: ', sample_pandas_index_data.values)
print('インデックスの値: ', sample_pandas_index_data.index)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64
a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64
データの値:  [ 0 10 20 30 40 50 60 70 80 90]
インデックスの値:  Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

DataFrameの使い方

In [17]:
attr_data1 = {
    'ID': ['100', '101', '102', '103', '104'],
    'City': ['Tokyo', 'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
    'Birth_Year': [1990, 1989, 1992, 1997, 1982],
    'Name': ['Hiroshi', 'Akio', 'Yuki', 'Satoru', 'Steve']
}

attr_data_frame1 = DataFrame(attr_data)
print(attr_data_frame1)

attr_data_frame_index1 = DataFrame(attr_data1, index=['a', 'b', 'c', 'd', 'e'])
print(attr_data_frame_index1)

# Jupyter環境ならprin()関数を使わずにDataFrameの内容が確認できる
attr_data_frame_index1

    ID      City  Birth_Year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989     Akio
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve
    ID      City  Birth_Year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989     Akio
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

    ID      City  Birth_Year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989     Akio
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

行列操作

In [20]:
# 転置=>行と列を入れ替える
attr_data_frame1.T

                  0      1      2         3      4
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_Year     1990   1989   1992      1997   1982
Name        Hiroshi   Akio   Yuki    Satoru  Steve

In [25]:
# 特定列のみを取り出す
attr_data_frame1['Birth_Year']

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_Year, dtype: int64

In [27]:
# 列名の指定(複数の場合)
attr_data_frame1[['ID', 'Name']]

    ID     Name
0  100  Hiroshi
1  101     Akio
2  102     Yuki
3  103   Satoru
4  104    Steve

データの抽出

In [28]:
# 条件(フィルター)
attr_data_frame1[attr_data_frame1['City'] == 'Tokyo']

    ID   City  Birth_Year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        1982    Steve

In [30]:
attr_data_frame1['City'] == 'Tokyo'

0     True
1    False
2    False
3    False
4     True
Name: City, dtype: bool

In [32]:
# 条件(フィルター、複数の値)
attr_data_frame1[attr_data_frame1['City'].isin(['Tokyo', 'Osaka'])]

    ID   City  Birth_Year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1989     Akio
4  104  Tokyo        1982    Steve

In [35]:
# Let's Try
attr_data_frame1[attr_data_frame1['Name'].isin(['Hiroshi', 'Steve'])]

    ID   City  Birth_Year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        1982    Steve

データの削除と結合

In [39]:
# 列の削除
attr_data_frame1.drop(['Birth_Year'], axis=1)

    ID      City     Name
0  100     Tokyo  Hiroshi
1  101     Osaka     Akio
2  102     Kyoto     Yuki
3  103  Hokkaido   Satoru
4  104     Tokyo    Steve

In [40]:
# データの結合
attr_data2 = {
    'ID': ['100', '101', '102', '105', '107'],
    'Math': [50, 43, 33, 76, 98],
    'English': [90, 30, 20, 50,30],
    'Sex': ['M', 'F', 'F', 'M', 'F']
}
attr_data_frame2 = DataFrame(attr_data2)
attr_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   F

In [41]:
# データのマージ(SQLのINNER JOINに相当)
pd.merge(attr_data_frame1, attr_data_frame2)

    ID   City  Birth_Year     Name  Math  English Sex
0  100  Tokyo        1990  Hiroshi    50       90   M
1  101  Osaka        1989     Akio    43       30   F
2  102  Kyoto        1992     Yuki    33       20   F

集計

In [43]:
# データのグループ集計
attr_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    58
M    63
Name: Math, dtype: int64

値のソート

In [54]:
# データの準備
attr_data3 = {
    'ID': ['100', '101', '102', '103', '104'],
    'City': ['Tokyo', 'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
    'Birth_Year': [1990, 1989, 1992, 1997, 1982],
    'Name': ['Hiroshi', 'Akio', 'Yuki', 'Satoru', 'Steve']
}
attr_data_frame3 = DataFrame(attr_data3)
attr_data_frame_index3 = DataFrame(attr_data3, index=['e', 'b', 'a', 'd', 'c'])
attr_data_frame_index3

    ID      City  Birth_Year     Name
e  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989     Akio
a  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
c  104     Tokyo        1982    Steve

In [55]:
# インデックスによるソート
attr_data_frame_index3.sort_index()

    ID      City  Birth_Year     Name
a  102     Kyoto        1992     Yuki
b  101     Osaka        1989     Akio
c  104     Tokyo        1982    Steve
d  103  Hokkaido        1997   Satoru
e  100     Tokyo        1990  Hiroshi

In [56]:
attr_data_frame_index3.Birth_Year.sort_values()

c    1982
b    1989
e    1990
a    1992
d    1997
Name: Birth_Year, dtype: int64

nan(null)の判定

In [57]:
# 条件に合致したデータの比較
# =>値があるかどうかの確認
attr_data_frame_index3.isin(['Tokyo'])

      ID   City  Birth_Year   Name
e  False   True       False  False
b  False  False       False  False
a  False  False       False  False
d  False  False       False  False
c  False   True       False  False

In [59]:
# nanとnullの例
# 欠損値の取り扱い
# nameをすべてnanにする
attr_data_frame_index3['Name'] = np.nan
attr_data_frame_index3
attr_data_frame_index3.isnull()

      ID   City  Birth_Year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [60]:
# nullを判定し、合計する
attr_data_frame_index3.isnull().sum()

ID            0
City          0
Birth_Year    0
Name          5
dtype: int64

Practice

In [63]:
# 2-7
attr_data1 = {
    'ID': ['1', '2', '3', '4', '5'],
    'Sex': ['F', 'F', 'M', 'M', 'F'],
    'Money': [1000, 2000, 500, 300, 700],
    'Name': ['Saito', 'Horie', 'Kondo', 'Kawada', 'Matsubara']
}
attr_data_frame1 = DataFrame(attr_data1)
attr_data_frame1[attr_data_frame1['Money'] >= 500]

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
4  5   F    700  Matsubara

In [70]:
# 2-8
attr_data_frame1.groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

In [78]:
# 2-9
attr_data2 = {
    'ID': ['3', '4', '7'],
    'Math': [60, 30, 40],
    'English': [80, 20, 30]
}
attr_data_frame2 = DataFrame(attr_data2)
merged = pd.merge(attr_data_frame1, attr_data_frame2)
print(merged['Money'].mean())
print(merged['Math'].mean())
print(merged['English'].mean())

400.0
45.0
50.0